{
  "about-me": "About Me",
  "skill-set": "Skill set",
  "my-work": "My work",
  "contact": "Contact",
  "text-lets-work-togehter": "Let's work togehter",
  "text-i-am": "I am",
  "text-located": "located in Recklinghausen",
  "text-remote": "open to work remote",
  "text-relocate": "open to relocate",
  "text-about-me": "As an aspiring full-stack developer, I already have a solid understanding of frontend development and continuously work on enhancing my skills to build complete web applications, from the user interface to the server logic.",
  "text-about-me-two": "In projects, I have learned to work both independently and as part of a team, approaching challenges in a solution-oriented and persistent manner. My open and communicative nature helps me collaborate closely with other developers to achieve the best possible outcome together.",
  "btn-send-a-message": "Send a message",
  "text-my-work": "My work",
  "text-example-work": "Explore a selection of my work here - Interact with projects to see my skills in action.",
  "text-need-a-team": "Need a teamplayer?",
  "text-here-what": "Here what my colleagues said about me",
  "text-contact": "Contact",
  "text-got-a": "Got a problem to solve?",
  "text-contact-me-through": "Contact me through this form, I am interested in hearing from you knowing your ideas and contributing to your projects with my work.",
  "text-need-a": "Need a Frontend developer?",
  "text-contact-me": "Contact me!",
  "text-your-name": "Your name",
  "text-name-required": "Your name is required",
  "text-your-email": "Your email",
  "text-email-required": "Your email is required",
  "text-your-message": "Your message",
  "text-message-required": "Your message is required",
  "text-ive-read": "I've read the ",
  "privacy-policy": "privacy policy",
  "text-and-agree": " and agree to the processing of my data as outlined.",
  "text-please-accept": "Please accept the privacy policy",
  "btn-say-hello": "Say hello ;)",
  "text-your-message-has": "Your message has been sent successfully!",
  "btn-close": "Close",
  "legal-notice": "Legal Notice",
  "text-information-according": "Information according",
  "text-information-according-two": "to § 5 TMG",
  "title-privacy-policy": "Privacy policy",
  "text-data-protection": "1. Data Protection at a Glance",
  "general-information": "General Information",
  "text-general-information": "The following information provides a simple overview of what happens to your personal data when you visit this website. Personal data is any information that can be used to identify you personally. Detailed information on the topic of data protection can be found in our privacy policy, which is linked below this text.",
  "data-collection": "Data Collection on this Website",
  "who-data-collection": "Who is responsible for the data collection on this website?",
  "text-data-collection": "The data processing on this website is carried out by the website operator. You can find the contact details in the section „Information on the Responsible Party\" in this privacy policy.",
  "how-do-we": "How do we collect your data?",
  "text-how-do-we": "Your data is collected in part by you providing it to us. This may include data you enter into a contact form, for example. Other data is collected automatically or with your consent when you visit the website through our IT systems. These are primarily technical data (e.g., internet browser, operating system, or time of page view). The collection of this data happens automatically as soon as you enter this website.",
  "what-do": "What do we use your data for?",
  "text-what-do": "Some of the data is collected to ensure the error-free provision of the website. Other data may be used to analyze your user behavior.",
  "what-rights": "What rights do you have regarding your data?",
  "text-what-rights": "You have the right to obtain, at any time and free of charge, information about the origin, recipients, and purpose of your stored personal data. You also have the right to request the correction or deletion of this data. If you have given consent for data processing, you can withdraw this consent at any time for the future. Additionally, you have the right to request the restriction of processing your personal data under certain circumstances. Furthermore, you have the right to file a complaint with the competent supervisory authority.",
  "you-can": "You can contact us at any time regarding this, as well as for any other questions related to data protection.",
  "hosting": "2. Hosting und Content Delivery Networks (CDN)",
  "we-host": "We host the content of our website with the following provider:",
  "the-provider-is": "The provider is IONOS SE, Elgendorfer Str. 57, 56410 Montabaur (hereinafter referred to as IONOS). When you visit our website, IONOS collects various log files, including your IP addresses. For details, please refer to IONOS's privacy policy:",
  "the-use-of": "The use of IONOS is based on Article 6(1)(f) of the GDPR. We have a legitimate interest in ensuring the most reliable presentation of our website. If explicit consent has been requested, the processing is carried out solely on the basis of Article 6(1)(a) of the GDPR and Section 25(1) of the TTDSG, insofar as the consent includes the storage of cookies or access to information on the user's device (e.g., device fingerprinting) within the meaning of the TTDSG. The consent can be revoked at any time.",
  "order-processing": "Order Processing",
  "text-order-processing": "We have entered into a data processing agreement (DPA) with the above-mentioned provider. This is a contract required by data protection laws, ensuring that they process the personal data of our website visitors only according to our instructions and in compliance with the GDPR.",
  "general-information-and": "3. General Information and Mandatory Information",
  "data-protection": "Data Protection",
  "the-operators": "The operators of this website take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the legal data protection regulations and this privacy policy.",
  "when-you-use": "When you use this website, various personal data is collected. Personal data is information that can be used to identify you personally. This privacy policy explains which data we collect and how we use it. It also explains how and for what purpose this happens.",
  "we-would-like": "We would like to point out that data transmission over the internet (e.g., when communicating via email) may have security vulnerabilities. Complete protection of data from third-party access is not possible.",
  "notice-regarding": "Notice regarding the responsible entity",
  "the-responsible-entity": "The responsible entity for data processing on this website is:",
  "phone": "Phone:",
  "email": "Email:",
  "the-responsible": "The responsible entity is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (e.g., names, email addresses, or similar).",
  "retention-period": "Retention Period",
  "unless-a-more": "Unless a more specific retention period is stated within this privacy policy, your personal data will remain with us until the purpose for data processing no longer applies. If you make a legitimate request for deletion or withdraw your consent for data processing, your data will be deleted, provided we have no other legally permissible reasons for retaining your personal data (e.g., tax or commercial retention periods). In the latter case, the deletion will occur once these reasons no longer apply.",
  "general-information-on-the": "General Information on the Legal Basis for Data Processing on This Website",
  "if-you-have": "If you have given consent to data processing, we process your personal data based on Art. 6 (1) (a) GDPR or Art. 9 (2) (a) GDPR, if special categories of data are processed under Art. 9 (1) GDPR. In the case of explicit consent for the transfer of personal data to third countries, the data processing also takes place based on Art. 49 (1) (a) GDPR. If you have consented to the storage of cookies or access to information on your device (e.g., via device fingerprinting), data processing is additionally based on § 25 (1) TTDSG. Consent can be revoked at any time. If your data is required for the performance of a contract or for pre-contractual measures, we process your data based on Art. 6 (1) (b) GDPR. Furthermore, we process your data if it is necessary to fulfill a legal obligation based on Art. 6 (1) (c) GDPR. Data processing may also occur based on our legitimate interest under Art. 6 (1) (f) GDPR. The specific legal basis applicable in each case will be explained in the following sections of this privacy policy.",
  "withdrawal": "Withdrawal of Your Consent to Data Processing",
  "many-data": "Many data processing activities are only possible with your explicit consent. You can withdraw your consent at any time. The lawfulness of data processing that occurred prior to the withdrawal remains unaffected by the withdrawal.",
  "right-to-object": "Right to Object to Data Collection in Special Cases and to Direct Marketing (Art. 21 GDPR)",
  "if-the-data-processing": "If the data processing is based on Art. 6 (1) (e) or (f) GDPR, you have the right to object at any time, for reasons arising from your particular situation, to the processing of your personal data; this also applies to profiling based on these provisions. The specific legal basis for which the processing is carried out can be found in this privacy policy. If you object, we will no longer process your affected personal data, unless we can demonstrate compelling legitimate grounds for the processing that override your interests, rights, and freedoms, or the processing serves the establishment, exercise, or defense of legal claims (objection under Art. 21 (1) GDPR).",
  "if-your-personal": "If your personal data is processed for direct marketing purposes, you have the right to object at any time to the processing of your personal data for such marketing purposes; this also applies to profiling, insofar as it is related to such direct marketing. If you object, your personal data will no longer be used for direct marketing purposes (objection under Art. 21 (2) GDPR).",
  "right-to-lodge": "Right to Lodge a Complaint with the Competent Supervisory Authority",
  "in-the-event": "In the event of violations of the GDPR, data subjects have the right to lodge a complaint with a supervisory authority, particularly in the member state of their usual residence, their place of work, or the location of the alleged infringement. The right to lodge a complaint exists without prejudice to any other administrative or judicial remedies.",
  "right-to-data": "Right to Data Portability",
  "you-have-the-right": "You have the right to request that data we process automatically based on your consent or in the performance of a contract be provided to you or to a third party in a commonly used, machine-readable format. If you request the direct transfer of data to another controller, this will only be done if it is technically feasible.",
  "access": "Access, Deletion, and Correction",
  "you-have": "You have the right, at any time and in accordance with applicable legal provisions, to obtain free information about your stored personal data, its origin, recipients, and the purpose of the data processing, and, if applicable, the right to correct or delete this data. For this purpose, as well as for any further questions regarding personal data, you can contact us at any time.",
  "right-to-restriction": "Right to Restriction of Processing",
  "you-have-the-right-to-request": "You have the right to request the restriction of the processing of your personal data. You can contact us at any time for this purpose. The right to restriction of processing applies in the following cases:",
  "ssl-or-tls": "SSL or TLS Encryption",
  "this-site-uses": "This site uses SSL or TLS encryption for security reasons and to protect the transmission of confidential content, such as orders or inquiries that you send to us as the website operator. You can recognize an encrypted connection by the fact that the browser address bar changes from \"http://\" to \"https://\" and by the lock symbol in your browser's address bar.",
  "when-ssl-or-tls": "When SSL or TLS encryption is enabled, the data you transmit to us cannot be read by third parties.",
  "objection-to": "Objection to Advertising Emails",
  "the-use-of-contact": "The use of contact data published as part of the imprint obligation for sending unsolicited advertising and informational materials is hereby objected to. The website operators expressly reserve the right to take legal action in the event of unsolicited sending of advertising information, such as spam emails.",
  "data-collection-on": "4. Data Collection on This Website",
  "our-websites": "Our websites use so-called \"cookies.\" Cookies are small data packets and do not cause any harm to your device. They are stored either temporarily for the duration of a session (session cookies) or permanently (persistent cookies) on your device. Session cookies are automatically deleted after your visit ends. Persistent cookies remain stored on your device until you delete them yourself or they are automatically deleted by your web browser.",
  "cookies-serve-various": "Cookies serve various functions. Many cookies are technically necessary, as certain website features would not function without them (e.g., the shopping cart feature or the display of videos). Other cookies are used to analyze user behavior or display advertisements.",
  "cookies-that-are-required": "Cookies that are required for the execution of the electronic communication process, to provide certain functions desired by you (e.g., the shopping cart feature), or to optimize the website (e.g., cookies for measuring web audience) are stored based on Art. 6 (1) (f) GDPR, unless another legal basis is provided. The website operator has a legitimate interest in storing necessary cookies to ensure the technical error-free and optimized provision of their services. If consent for the storage of cookies and similar recognition technologies has been requested, processing will take place solely based on this consent (Art. 6 (1) (a) GDPR and § 25 (1) TTDSG); consent can be withdrawn at any time.",
  "you-can-configure-your-browser": "You can configure your browser to be notified about the setting of cookies and allow cookies only in individual cases, exclude the acceptance of cookies for specific cases or generally, and enable the automatic deletion of cookies when closing the browser. Disabling cookies may limit the functionality of this website.",
  "contact-form": "Contact Form",
  "if-you-send": "If you send us inquiries via the contact form, the information you provide in the form, including the contact details you provide, will be stored by us for the purpose of processing the inquiry and in case of follow-up questions. We do not share this data without your consent.",
  "the-processing-of-this-data": "The processing of this data is based on Art. 6 (1) (b) GDPR if your inquiry is related to the fulfillment of a contract or necessary for the implementation of pre-contractual measures. In all other cases, the processing is based on our legitimate interest in effectively handling the inquiries directed to us (Art. 6 (1) (f) GDPR) or on your consent (Art. 6 (1) (a) GDPR), if it was requested; consent can be withdrawn at any time.",
  "the-data-you": "The data you enter in the contact form will remain with us until you request its deletion, revoke your consent for storage, or the purpose for data storage no longer applies (e.g., after your inquiry has been processed). Mandatory legal provisions, particularly retention periods, remain unaffected.",
  "inquiry-by-email": "Inquiry by Email, Phone, or Fax",
  "if-you-contact-us": "If you contact us by email, phone, or fax, your inquiry, including all personal data resulting from it (name, inquiry), will be stored and processed by us for the purpose of handling your request. We do not share this data without your consent.",
  "the-processing": "The processing of this data is based on Art. 6 (1) (b) GDPR if your inquiry is related to the fulfillment of a contract or necessary for the implementation of pre-contractual measures. In all other cases, the processing is based on our legitimate interest in effectively handling the inquiries directed to us (Art. 6 (1) (f) GDPR) or on your consent (Art. 6 (1) (a) GDPR), if it was requested; consent can be withdrawn at any time.",
  "the-data-you-send": "The data you send to us through contact inquiries will remain with us until you request its deletion, revoke your consent for storage, or the purpose for data storage no longer applies (e.g., after your request has been processed). Mandatory legal provisions, particularly statutory retention periods, remain unaffected.",
  "social-media": "5. Social Media",
  "this-website": "This website uses elements from social media platforms (e.g., GitHub, LinkedIn).",
  "the-social-media-elements": "The social media elements can usually be recognized by their respective social media logos. To ensure data protection on this website, we use these elements only in conjunction with the so-called \"Shariff\" solution. This application prevents the integrated social media elements on this website from transferring your personal data to the respective provider as soon as you visit the page.",
  "only-when-you": "Only when you activate the respective social media element by clicking the corresponding button is a direct connection established with the provider's server (consent). Once you activate the social media element, the respective provider receives the information that you have visited this website with your IP address. If you are simultaneously logged into your respective social media account (e.g., LinkedIn), the provider can associate your visit to this website with your user account.",
  "activating": "Activating the plugin constitutes consent within the meaning of Art. 6 (1) (a) GDPR and § 25 (1) TTDSG. You can withdraw this consent at any time with effect for the future.",
  "the-use-of-the-service": "The use of the service is to obtain the legally required consents for the use of certain technologies. The legal basis for this is Art. 6 (1) (c) GDPR.",
  "analytics-tools": "6. Analytics Tools and Advertising",
  "this-website-uses-the-analytics": "This website uses the analytics services of IONOS WebAnalytics (hereinafter referred to as IONOS). The provider is 1&1 IONOS SE, Elgendorfer Straße 57, D – 56410 Montabaur. As part of the analysis with IONOS, various data such as visitor numbers and behavior (e.g., page views, duration of website visits, bounce rates), visitor sources (i.e., the page the visitor came from), visitor locations, and technical data (browser and operating system versions) may be analyzed. For this purpose, IONOS stores, in particular, the following data:",
  "referrer": "Referrer (previously visited website)",
  "requested": "requested webpage or file",
  "browser": "browser type and browser version",
  "operating": "operating system used",
  "device": "device type used",
  "time": "time of access",
  "ip-address": "IP address in anonymized form (used only to determine the location of access)",
  "the-data-collection": "The data collection is carried out by IONOS in a fully anonymized manner, so it cannot be traced back to individual persons. Cookies are not stored by IONOS WebAnalytics.",
  "the-storage": "The storage and analysis of the data are carried out based on Art. 6 para. 1 lit. f GDPR. The website operator has a legitimate interest in the statistical analysis of user behavior in order to optimize both their web offering and advertising. If consent has been requested, the processing is carried out exclusively based on Art. 6 para. 1 lit. a GDPR and § 25 para. 1 TTDSG, insofar as the consent includes the storage of cookies or access to information on the user's device (e.g., device fingerprinting) within the meaning of the TTDSG. The consent can be revoked at any time.",
  "for-more-information": "For more information on the data collection and processing by IONOS WebAnalytics, please refer to the privacy policy of IONOS at the following link:",
  "we-have-entered": "We have entered into a Data Processing Agreement (DPA) with the provider mentioned above. This is a contract required by data protection law, ensuring that they process the personal data of our website visitors only according to our instructions and in compliance with the GDPR."
}